function demo() {

let number = 5; // тази променлива може да бъде използвана само в къдравите скоби, в които е

if(number < 10) {
    console.log("Number is < 10"); // ако иф не връща истина, продължава към елсе
} 

if(number < 15) {
    console.log("Number is < 15"); // отделни проверки, не си пречат взаимно (отделни кодове) - може да ги отпечата и трите, ако са верни; ако ги сменим с елсе иф - става последователност от проверки и цялото блокче е едно парче код
}

if(number < 20) {
    console.log("Number is < 20");
}

}

demo()